[
  {
    "name": "ksh",
    "options": [
      {
        "type": "short",
        "key": "c",
        "title": "-c string",
        "description": "ksh will execute the command(s) contained in string."
      },
      {
        "type": "short",
        "key": "i",
        "title": "-i",
        "description": "Interactive shell. A shell is “interactive” if this option is used or if both standard input and standard error are attached to a tty(4). An interactive shell has job control enabled, ignores the SIGINT, SIGQUIT, and SIGTERM signals, and prints prompts before reading input (see the PS1 and PS2 parameters). For non-interactive shells, the trackall option is on by default (see the set command below)."
      },
      {
        "type": "short",
        "key": "l",
        "title": "-l",
        "description": "Login shell. If the basename the shell is called with (i.e. argv[0]) starts with ‘-’ or if this option is used, the shell is assumed to be a login shell and the shell reads and executes the contents of /etc/profile and $HOME/.profile if they exist and are readable."
      },
      {
        "type": "short",
        "key": "p",
        "title": "-p",
        "description": "Privileged shell. A shell is “privileged” if this option is used or if the real user ID or group ID does not match the effective user ID or group ID (see getuid(2) and getgid(2)). A privileged shell does not process $HOME/.profile nor the ENV parameter (see below). Instead, the file /etc/suid_profile is processed. Clearing the privileged option causes the shell to set its effective user ID (group ID) to its real user ID (group ID)."
      },
      {
        "type": "short",
        "key": "r",
        "title": "-r",
        "description": "Restricted shell. A shell is “restricted” if this option is used; if the basename the shell was invoked with was “rksh”; or if the SHELL parameter is set to “rksh”. The following restrictions come into effect after the shell processes any profile and ENV files:\n\n\n\n * The cd command is disabled.\n * The SHELL, ENV, and PATH parameters cannot be changed.\n * Command names can't be specified with absolute or relative paths.\n * The -p option of the built-in command command can't be used.\n * Redirections that create files can't be used (i.e. ‘>’, ‘>|’, ‘>>’, ‘<>’)."
      },
      {
        "type": "short",
        "key": "s",
        "title": "-s",
        "description": "The shell reads commands from standard input; all non-option arguments are positional parameters."
      }
    ]
  }
]
