[
  {
    "name": "mount",
    "optionStyle": "short-and-long",
    "options": [
      {
        "key": "A",
        "title": "-A",
        "description": "Causes mount to try to mount all of the file systems listed in the fstab(5) table except those for which the “noauto” or “net” options are specified."
      },
      {
        "key": "a",
        "title": "-a",
        "description": "Similar to the -A flag, except that if a file system (other than the root file system) appears to be already mounted, mount will not try to mount it again. mount assumes that a file system is already mounted if a file system with the same type is mounted on the given mount point. More stringent checks are not possible because some file system types report strange values for the mounted-from device for mounted file systems."
      },
      {
        "key": "d",
        "title": "-d",
        "description": "Causes everything to be done except for the invocation of the file system specific program. This option is useful in conjunction with the -v flag to determine what the mount command is trying to do."
      },
      {
        "key": "f",
        "title": "-f",
        "description": "Either force mounting of dirty file systems or, in the case of a downgrade from read-write to read-only operation, the revocation of opened files with write access."
      },
      {
        "key": "N",
        "title": "-N",
        "description": "If used with either -A or -a, mount will only look at file systems which have the “net” option specified. By default file systems with the “net” option are ignored."
      },
      {
        "key": "o",
        "title": "-o options",
        "description": "Options can be given with (or without) a ‘no’ prefix to invert their meaning. The options listed below specify non-default values. For example, ‘nosoftdep’ is the default, so ‘softdep’ can be used to mount the file system using soft dependencies. Multiple options can be specified in a comma-separated list. The available options are as follows: async Metadata I/O to the file system should be done asynchronously. By default, only regular data is read/written asynchronously.\n\nThis is a dangerous flag to set since it does not guarantee to keep a consistent file system structure on the disk. You should not use this flag unless you are prepared to recreate the file system should your system crash. The most common use of this flag is to speed up restore(8) where it can give a factor of two speed increase.\n\nThe options async and softdep are mutually exclusive.\n\nforce The same as -f; forces the revocation of write access when trying to downgrade a file system mount status from read-write to read-only. noatime Do not update atime on files in the system unless the mtime or ctime is being changed as well. This option is useful for laptops and news servers where one does not want the extra disk activity associated with updating the atime. nodev Do not interpret character or block special devices on the file system. This option is useful for a server that has file systems containing special devices for architectures other than its own. noexec Do not allow execution of any binaries on the mounted file system. This option is useful for a server that has file systems containing binaries for architectures other than its own. noperm (FFS only) Do not check permissions when creating, accessing or modifying files and directories in the mounted file system. This allows unprivileged users to construct a file hierarchy containing special device nodes and files with arbitrary file mode, owner or group without restriction. Only the owner, group and mode of the root directory of the filesystem will be honored so access to the filesystem can be locked down. The noperm option also enables the nodev and noexec options to ensure that interpretation of the file modes and special devices cannot be used to gain privileges. norw An alias for rdonly. nosuid Do not allow set-user-identifier or set-group-identifier bits to take effect. rdonly The same as -r; mount the file system read-only (even the superuser may not write it). ro An alias for rdonly. softdep (FFS only) Mount the file system using soft dependencies. Instead of metadata being written immediately, it is written in an ordered fashion to keep the on-disk state of the file system consistent. This results in significant speedups for file create/delete operations. This option is ignored when using the -u flag and a file system is already mounted read/write.\n\nThe options async and softdep are mutually exclusive.\n\nsync Regular data I/O to the file system should be done synchronously. By default, only metadata is read/written synchronously. update The same as -u; indicate that the status of an already mounted file system should be changed. wxallowed Processes that ask for memory to be made writeable plus executable using the mmap(2) and mprotect(2) system calls are killed by default. This option allows those processes to continue operation. It is typically used on the /usr/local filesystem.\n\nAny additional options specific to a given file system type (see the -t option) may be passed as a comma separated list; these options are distinguished by a leading “-” (dash). Options that take a value are specified using the syntax -option=value. For example:\n\n# mount -t mfs -o rw,nodev,nosuid,-s=153600 /dev/sd0b /tmp\n\nThat causes mount to execute the equivalent of:\n\n# /sbin/mount_mfs -o rw,nodev,nosuid -s 153600 /dev/sd0b /tmp\n\nThe equivalent example in fstab(5) would be:\n\nswap /tmp mfs rw,nodev,nosuid,-s=153600 0 0"
      },
      {
        "key": "r",
        "title": "-r",
        "description": "The file system is to be mounted read-only. Mount the file system read-only (even the superuser may not write it). The same as the “rdonly” argument to the -o option."
      },
      {
        "key": "s",
        "title": "-s",
        "description": "Skip mounting the file system if it is already mounted. See the -a flag for a description of the criteria used to decide if a file system is already mounted."
      },
      {
        "key": "t",
        "title": "-t type",
        "description": "The argument following the -t is used to indicate the file system type. The type ffs is the default. The -t option can be used to indicate that the actions should only be taken on file systems of the specified type. More than one type may be specified in a comma separated list. The list of file system types can be prefixed with “no” to specify the file system types for which action should not be taken. For example, the mount command:\n\n# mount -a -t nonfs,mfs\n\nmounts all file systems except those of type NFS and MFS.\n\nmount will attempt to execute a program in /sbin/mount_XXX where XXX is replaced by the type name. For example, NFS file systems are mounted by the program /sbin/mount_nfs."
      },
      {
        "key": "u",
        "title": "-u",
        "description": "The -u flag indicates that the status of an already mounted file system should be changed. Any of the options discussed above (the -o option) may be changed; also a file system can be changed from read-only to read-write or vice versa. An attempt to change from read-write to read-only will fail if any files on the file system are currently open for writing unless the -f flag is also specified. Only options specified on the command line with -o are changed; other file system options are unaltered. The options set in the fstab(5) table are ignored."
      },
      {
        "key": "v",
        "title": "-v",
        "description": "Verbose mode."
      },
      {
        "key": "w",
        "title": "-w",
        "description": "The file system object is to be read and write."
      }
    ]
  }
]
