[
  {
    "name": "ping",
    "options": [
      {
        "type": "short",
        "key": "c",
        "title": "-c count",
        "description": "Stop sending after count\n      ECHO_REQUEST packets have been sent. If\n      count is 0, send an unlimited number of\n    packets."
      },
      {
        "type": "short",
        "key": "D",
        "title": "-D",
        "description": "Don't fragment IP packets."
      },
      {
        "type": "short",
        "key": "d",
        "title": "-d",
        "description": "Set the SO_DEBUG option on the socket being used.\n      This option has no effect on OpenBSD."
      },
      {
        "type": "short",
        "key": "E",
        "title": "-E",
        "description": "Emit an audible beep (by sending an ASCII BEL character to the standard\n      error output) when no packet is received before the next packet is\n      transmitted. To cater for round-trip times that are longer than the\n      interval between transmissions, further missing packets cause a bell only\n      if the maximum number of unreceived packets has increased. This option is\n      disabled for flood pings."
      },
      {
        "type": "short",
        "key": "e",
        "title": "-e",
        "description": "Emit an audible beep (by sending an ASCII BEL character to the standard\n      error output) after each non-duplicate response is received. This option\n      is disabled for flood pings."
      },
      {
        "type": "short",
        "key": "f",
        "title": "-f",
        "description": "Flood ping. Outputs packets as fast as they come back or one hundred times\n      per second, whichever is more. For every\n      ECHO_REQUEST sent, a period ‘.’ is\n      printed, while for every ECHO_REPLY received a\n      backspace is printed. This provides a rapid display of how many packets\n      are being dropped. Only the superuser may use this option.\n    This can be very hard on a network and should be used\n      with caution."
      },
      {
        "type": "short",
        "key": "g",
        "title": "-g",
        "description": "Provides a visual display of packets received and lost. For every\n      ECHO_REPLY received, an exclamation mark\n      ‘!’ is printed, while for every missed packet a period\n      ‘.’ is printed. Duplicate and truncated replies are\n      indicated with ‘D’ and ‘T’ respectively."
      },
      {
        "type": "short",
        "key": "H",
        "title": "-H",
        "description": "Try reverse lookups for addresses."
      },
      {
        "type": "short",
        "key": "h",
        "title": "-h hoplimit",
        "description": "(IPv6 only) Set the hoplimit."
      },
      {
        "type": "short",
        "key": "I",
        "title": "-I sourceaddr",
        "description": "Set the source address to transmit from, which is useful on machines with\n      multiple interfaces. For unicast and multicast pings."
      },
      {
        "type": "short",
        "key": "i",
        "title": "-i interval",
        "description": "Send one packet every interval seconds. The default\n      is one second. The interval may contain a fractional\n      portion. Only the superuser may specify a value less than one second. This\n      option is incompatible with the -f option."
      },
      {
        "type": "short",
        "key": "L",
        "title": "-L",
        "description": "Disable the loopback, so the transmitting host doesn't see the ICMP\n      requests. For multicast pings."
      },
      {
        "type": "short",
        "key": "l",
        "title": "-l preload",
        "description": "Send preload packets as fast as possible before\n      reverting to normal behavior. Only root may set a preload value."
      },
      {
        "type": "short",
        "key": "m",
        "title": "-m",
        "description": "(IPv6 only) Do not fragment unicast packets to fit the minimum IPv6 MTU.\n      If specified twice, do this for multicast packets as well."
      },
      {
        "type": "short",
        "key": "n",
        "title": "-n",
        "description": "Numeric output only. No attempt will be made to look up symbolic names\n      from addresses in the reply."
      },
      {
        "type": "short",
        "key": "p",
        "title": "-p pattern",
        "description": "Specify up to 16 pad bytes to fill out the packet sent. This is useful for\n      diagnosing data-dependent problems in a network. For example, \"-p\n      ff\" causes the sent packet to be filled with all ones."
      },
      {
        "type": "short",
        "key": "q",
        "title": "-q",
        "description": "Quiet output. Nothing is displayed except the summary lines at startup\n      time and when finished."
      },
      {
        "type": "short",
        "key": "R",
        "title": "-R",
        "description": "(IPv4 only) Record route. Includes the\n      RECORD_ROUTE option in the\n      ECHO_REQUEST packet and displays the route buffer\n      on returned packets. Note that the IP header is only large enough for nine\n      such routes. If more routes come back than should, such as due to an\n      illegal spoofed packet, ping will print the route\n      list and then truncate it at the correct spot. Many hosts ignore or\n      discard this option."
      },
      {
        "type": "short",
        "key": "s",
        "title": "-s packetsize",
        "description": "Specify the number of data bytes to be sent. The default is 56, which\n      translates into 64 ICMP data bytes when combined with the 8 bytes of ICMP\n      header data. The maximum packet size is 65467 for IPv4 and 65527 for\n    IPv6."
      },
      {
        "type": "short",
        "key": "T",
        "title": "-T toskeyword",
        "description": "Change the IPv4 TOS or IPv6 Traffic Class value.\n      toskeyword may be one of\n      critical, inetcontrol,\n      lowdelay, netcontrol,\n      throughput, reliability,\n      or one of the DiffServ Code Points: ef,\n      af11 ... af43, cs0 ...\n      cs7; or a number in either hex or decimal."
      },
      {
        "type": "short",
        "key": "t",
        "title": "-t ttl",
        "description": "(IPv4 only) Use the specified time-to-live."
      },
      {
        "type": "short",
        "key": "V",
        "title": "-V rtable",
        "description": "Set the routing table to be used for outgoing packets."
      },
      {
        "type": "short",
        "key": "v",
        "title": "-v",
        "description": "Verbose output. ICMP packets other than ECHO_REPLY\n      that are received are listed."
      },
      {
        "type": "short",
        "key": "w",
        "title": "-w maxwait",
        "description": "Specify the maximum number of seconds to wait for responses after the last\n      request has been sent. The default is 10."
      }
    ]
  }
]
