[
  {
    "name": "ps",
    "options": [
      {
        "type": "short",
        "key": "A",
        "title": "-A",
        "description": "Display information about processes for all users, including those without controlling terminals."
      },
      {
        "type": "short",
        "key": "a",
        "title": "-a",
        "description": "Display information about processes for all users with controlling terminals."
      },
      {
        "type": "short",
        "key": "c",
        "title": "-c",
        "description": "Do not display full command with arguments, but only the executable name. This may be somewhat confusing; for example, all sh(1) scripts will show as “sh”."
      },
      {
        "type": "short",
        "key": "e",
        "title": "-e",
        "description": "Display the environment as well."
      },
      {
        "type": "short",
        "key": "H",
        "title": "-H",
        "description": "Also display information about kernel visible threads."
      },
      {
        "type": "short",
        "key": "h",
        "title": "-h",
        "description": "Repeat the information header as often as necessary to guarantee one header per page of information."
      },
      {
        "type": "short",
        "key": "j",
        "title": "-j",
        "description": "Print information associated with the following keywords: user, pid, ppid, pgid, sess, jobc, state, tt, time, and command."
      },
      {
        "type": "short",
        "key": "k",
        "title": "-k",
        "description": "Also display information about kernel threads."
      },
      {
        "type": "short",
        "key": "L",
        "title": "-L",
        "description": "List the set of available keywords. This option should not be specified with other options."
      },
      {
        "type": "short",
        "key": "l",
        "title": "-l",
        "description": "Display information associated with the following keywords: uid, pid, ppid, cpu, pri, nice, vsz, rss, wchan, state, tt, time, and command."
      },
      {
        "type": "short",
        "key": "M",
        "title": "-M core",
        "description": "Extract values associated with the name list from the specified core instead of the running kernel."
      },
      {
        "type": "short",
        "key": "m",
        "title": "-m",
        "description": "Sort by memory usage, instead of by start time ID."
      },
      {
        "type": "short",
        "key": "N",
        "title": "-N system",
        "description": "Extract the name list from the specified system instead of the running kernel."
      },
      {
        "type": "short",
        "key": "O",
        "title": "-O fmt",
        "description": "Add the information associated with the space or comma separated list of keywords specified, after the process ID, in the default information display. Keywords may be appended with an equals sign (‘=’) and a string. This causes the printed header to use the specified string instead of the standard header."
      },
      {
        "type": "short",
        "key": "o",
        "title": "-o fmt",
        "description": "Display information associated with the space or comma separated list of keywords specified. Keywords may be appended with an equals sign (‘=’) and a string. This causes the printed header to use the specified string instead of the standard header."
      },
      {
        "type": "short",
        "key": "p",
        "title": "-p pid",
        "description": "Display information associated with the specified process ID."
      },
      {
        "type": "short",
        "key": "r",
        "title": "-r",
        "description": "Sort by current CPU usage, instead of by start time ID."
      },
      {
        "type": "short",
        "key": "S",
        "title": "-S",
        "description": "Change the way the process time is calculated by summing all exited children to their parent process."
      },
      {
        "type": "short",
        "key": "T",
        "title": "-T",
        "description": "Display information about processes attached to the device associated with the standard input."
      },
      {
        "type": "short",
        "key": "t",
        "title": "-t tty",
        "description": "Display information about processes attached to the specified terminal device."
      },
      {
        "type": "short",
        "key": "U",
        "title": "-U username",
        "description": "Display the processes belonging to the specified username."
      },
      {
        "type": "short",
        "key": "u",
        "title": "-u",
        "description": "Display information associated with the following keywords: user, pid, %cpu, %mem, vsz, rss, tt, state, start, time, and command. The -u option implies the -r option."
      },
      {
        "type": "short",
        "key": "v",
        "title": "-v",
        "description": "Display information associated with the following keywords: pid, state, time, sl, re, pagein, vsz, rss, lim, tsiz, %cpu, %mem, and command. The -v option implies the -m option."
      },
      {
        "type": "short",
        "key": "W",
        "title": "-W swap",
        "description": "When not using the running kernel, extract swap information from the specified file."
      },
      {
        "type": "short",
        "key": "w",
        "title": "-w",
        "description": "Use 132 columns to display information, instead of the default, which is the window size. If the -w option is specified more than once, ps will use as many columns as necessary without regard for window size."
      },
      {
        "type": "short",
        "key": "x",
        "title": "-x",
        "description": "Display information about processes without controlling terminals."
      }
    ]
  }
]
