[
  {
    "name": "tar",
    "options": [
      {
        "type": "short",
        "key": "c",
        "title": "-c",
        "description": "Create new archive, or overwrite an existing archive, adding the specified files to it."
      },
      {
        "type": "short",
        "key": "r",
        "title": "-r",
        "description": "Append the named new files to existing archive. Note that this will only work on media on which an end-of-file mark can be overwritten."
      },
      {
        "type": "short",
        "key": "t",
        "title": "-t",
        "description": "List contents of archive. If any files are named on the command line, only those files will be listed. The file arguments may be specified as glob patterns (see glob(7) for more information), in which case tar will list all archive members that match each pattern."
      },
      {
        "type": "short",
        "key": "u",
        "title": "-u",
        "description": "Alias for -r."
      },
      {
        "type": "short",
        "key": "x",
        "title": "-x",
        "description": "Extract files from archive. If any files are named on the command line, only those files will be extracted from the archive. The file arguments may be specified as glob patterns (see glob(7) for more information), in which case tar will extract all archive members that match each pattern.\n\nIf more than one copy of a file exists in the archive, later copies will overwrite earlier copies during extraction. The file mode and modification time are preserved if possible. The file mode is subject to modification by the umask(2)."
      },
      {
        "type": "short",
        "key": "b",
        "title": "-b blocking-factor",
        "description": "Set blocking factor to use for the archive. tar uses 512-byte blocks. The default is 20, the maximum is 126. Archives with a blocking factor larger than 63 violate the POSIX standard and will not be portable to all systems."
      },
      {
        "type": "short",
        "key": "C",
        "title": "-C directory",
        "description": "This is a positional argument which sets the working directory for the following files. When extracting, files will be extracted into the specified directory; when creating, the specified files will be matched from the directory."
      },
      {
        "type": "short",
        "key": "e",
        "title": "-e",
        "description": "Stop after the first error."
      },
      {
        "type": "short",
        "key": "f",
        "title": "-f archive",
        "description": "Read from or write to archive. A hyphen (-) can be used to represent standard input or output. The default is /dev/rst0. See also the TAPE environment variable."
      },
      {
        "type": "short",
        "key": "H",
        "title": "-H",
        "description": "Follow symlinks given on the command line only."
      },
      {
        "type": "short",
        "key": "h",
        "title": "-h",
        "description": "Follow symbolic links as if they were normal files or directories. In extract mode this means that a directory entry in the archive will not overwrite an existing symbolic link, but rather what the link ultimately points to."
      },
      {
        "type": "short",
        "key": "I",
        "title": "-I file",
        "description": "This is a positional argument which reads the names of files to archive or extract from the given file, one per line."
      },
      {
        "type": "short",
        "key": "j",
        "title": "-j",
        "description": "Compress archive using bzip2. The bzip2 utility must be installed separately."
      },
      {
        "type": "short",
        "key": "L",
        "title": "-L",
        "description": "Synonym for the -h option."
      },
      {
        "type": "short",
        "key": "m",
        "title": "-m",
        "description": "Do not preserve modification time."
      },
      {
        "type": "short",
        "key": "N",
        "title": "-N",
        "description": "Use only the numeric UID and GID values when creating or extracting an archive."
      },
      {
        "type": "short",
        "key": "O",
        "title": "-O",
        "description": "Write old-style (non-POSIX) archives."
      },
      {
        "type": "short",
        "key": "o",
        "title": "-o",
        "description": "Don't write directory information that the older (V7) style tar is unable to decode. This implies the -O flag."
      },
      {
        "type": "short",
        "key": "P",
        "title": "-P",
        "description": "Do not strip leading slashes (‘/’) from pathnames. The default is to strip leading slashes."
      },
      {
        "type": "short",
        "key": "p",
        "title": "-p",
        "description": "Preserve user and group ID as well as file mode regardless of the current umask(2). The setuid and setgid bits are only preserved if the user and group ID could be preserved. Only meaningful in conjunction with the -x flag."
      },
      {
        "type": "short",
        "key": "q",
        "title": "-q",
        "description": "Select the first archive member that matches each file operand. No more than one archive member is matched for each file. When members of type directory are matched, the file hierarchy rooted at that directory is also matched."
      },
      {
        "type": "short",
        "key": "s",
        "title": "-s replstr",
        "description": "Modify the archive member names according to the substitution expression replstr, using the syntax of the ed(1) utility regular expressions. file arguments may be given to restrict the list of archive members to those specified.\n\nThe format of these regular expressions is\n\n/old/new/[gp]\n\nAs in ed(1), old is a basic regular expression (see re_format(7)) and new can contain an ampersand (‘&’), ‘\\n’ (where n is a digit) back-references, or subexpression matching. The old string may also contain newline characters. Any non-null character can be used as a delimiter (‘/’ is shown here). Multiple -s expressions can be specified. The expressions are applied in the order they are specified on the command line, terminating with the first successful substitution.\n\nThe optional trailing g continues to apply the substitution expression to the pathname substring, which starts with the first character following the end of the last successful substitution. The first unsuccessful substitution stops the operation of the g option. The optional trailing p will cause the final result of a successful substitution to be written to standard error in the following format:\n\noriginal-pathname >> new-pathname\n\nFile or archive member names that substitute to the empty string are not selected and will be skipped."
      },
      {
        "type": "short",
        "key": "v",
        "title": "-v",
        "description": "Verbose operation mode. If -v is specified multiple times or if the -t option is also specified, tar will use a long format for listing files, similar to ls(1) -l."
      },
      {
        "type": "short",
        "key": "w",
        "title": "-w",
        "description": "Interactively rename files. This option causes tar to prompt the user for the filename to use when storing or extracting files in an archive."
      },
      {
        "type": "short",
        "key": "X",
        "title": "-X",
        "description": "Do not cross mount points in the file system."
      },
      {
        "type": "short",
        "key": "Z",
        "title": "-Z",
        "description": "Compress archive using compress(1)."
      },
      {
        "type": "short",
        "key": "z",
        "title": "-z",
        "description": "Compress archive using gzip(1)."
      }
    ]
  }
]
